print("Скажи имя.")
dope = input()
print("Хорошо," + dope)
print("Как твои дела, " + dope )
fart = input()
if fart == "Хорошо.":
    print("Тогда пока," + dope + ", эта программа сделана для поднятия настроения!")
if fart == "плохо..":
    print("Тебе нужен карманный калькулятор, " + dope + "?")
    nigga = input()
    if nigga == "нет":
        print("пидорас блять ты всю шутку испортил гандон ты че делаешь")
        import time
        time.sleep(1)
        print("гандон блять сходи корове козявки поковыряй блять пидрила")
        time.sleep(0.3)
        print("шутки портишь гандон блять ебанный")
